def hash_function(word):
    dictionary = {
        'А': 1, 'Б': 1, 'В': 1, 'Г': 2, 'Д': 2, 'Е': 2, 'Є': 2,
        'Ж': 3, 'З': 3, 'И': 3, 'І': 3, 'Ї': 3, 'Й': 3,
        'К': 4, 'Л': 4, 'М': 5, 'Н': 5, 'О': 6, 'П': 6,
        'Р': 7, 'С': 7, 'Т': 8, 'У': 8, 'Ф': 8, 'Х': 8,
        'Ц': 8, 'Ч': 8, 'Ш': 8, 'Щ': 9, 'Ь': 9, 'Ю': 9,
        'Я': 9
    }

    code = ''
    for char in word:
        code += str(dictionary.get(char.upper()))  # перекодовуємо кожну букву в хеш
    code += '0' * (10 - len(code))  # додаємо нулі до коду, щоб отримати 10 значень

    return int(code)



# Приклад використання:
names = [
    "Зайченко",
    "Заіченко",
    "Зайко",
    "Петров",
    "Петриченко",
    "Петропавлов"
]

for name in names:
    hashed_name = hash_function(name)
    print(f"Ім'я: {name}, Хеш-код: {hashed_name}")
